ThaoVy1607/MSP430_Ultrasonic_SIM7670C/examples/USS_Water_Demo/USSLibGUIApp/fr6047_USS_app/resultsDC/results.c
#include <resultsDC/results.h>
#include <mathematicsDC/mathematics.h>
#include <masterIncludes.h>

#if defined(__TI_COMPILER_VERSION__)
#pragma PERSISTENT(g_ResultsOfLastMeasurement)
#define __persistent
#elif defined (__IAR_SYSTEMS_ICC__)
#else
#error Compiler not supported!
#endif

__persistent RESULTS_MEASUREMENT_DATA g_ResultsOfLastMeasurement =
{
		.last_dtof = 0,
		.avg_dtof = 0,
		.stdev_dtof = 0,

		.last_FlowRate = 0,
		.avg_FlowRate= 0,

		.last_volume = 0,

		.FR_unit = LPH,

		.BatteryPercentageStamp = 0,
		.temp = 0,
		.DateAndTimeStamp = 0,
};

volatile int datapointIndex = 0;

void results_Reset(bool unit)
{
	int i = 0;
	g_ResultsOfLastMeasurement.last_dtof = 0.0;
	g_ResultsOfLastMeasurement.avg_dtof = 0.0;
	g_ResultsOfLastMeasurement.stdev_dtof = 0.0;

	g_ResultsOfLastMeasurement.last_FlowRate = 0.0;
	g_ResultsOfLastMeasurement.avg_FlowRate= 0.0;

	g_ResultsOfLastMeasurement.last_volume = 0.0;

	g_ResultsOfLastMeasurement.BatteryPercentageStamp = 0;
	g_ResultsOfLastMeasurement.temp = 0;

	g_ResultsOfLastMeasurement.FR_unit = unit;

	for(i = 0; i < X_NUM_MEASUREMENTS; i++)
	{
		g_ResultsOfLastMeasurement.last_X_dtofMeasurements[i] = 0;
		g_ResultsOfLastMeasurement.last_X_FlowRateMeasurements[i] = 0;
	}
}

void results_Update(float dtofData, float volrateData, uint16_t rate)
{
	// reset index if needed
	if(X_NUM_MEASUREMENTS == datapointIndex)
	{
		datapointIndex = 0;
	}

	// Update each of the results statistics and data points with the last
	// measurement data
	g_ResultsOfLastMeasurement.last_dtof = dtofData;
	g_ResultsOfLastMeasurement.last_X_dtofMeasurements[datapointIndex] =
			g_ResultsOfLastMeasurement.last_dtof;
	g_ResultsOfLastMeasurement.avg_dtof =
			mathematics_CalcAverageflt((float*) &g_ResultsOfLastMeasurement.last_X_dtofMeasurements,
					                   (uint16_t) X_NUM_MEASUREMENTS);
	g_ResultsOfLastMeasurement.stdev_dtof =
			mathematics_CalcStDevflt((float*) &g_ResultsOfLastMeasurement.last_X_dtofMeasurements,
					                 g_ResultsOfLastMeasurement.avg_dtof,
									 (uint16_t) X_NUM_MEASUREMENTS);

	g_ResultsOfLastMeasurement.last_FlowRate = volrateData;
	g_ResultsOfLastMeasurement.last_X_FlowRateMeasurements[datapointIndex] =
			g_ResultsOfLastMeasurement.last_FlowRate;
	g_ResultsOfLastMeasurement.avg_FlowRate =
			mathematics_CalcMedian3of5((float*) &g_ResultsOfLastMeasurement.last_X_FlowRateMeasurements,
					                   (uint16_t) X_NUM_MEASUREMENTS);

	g_ResultsOfLastMeasurement.last_volume += resultsCalcVolume(rate);

#ifdef ENABLE_ADC
	g_ResultsOfLastMeasurement.BatteryPercentageStamp =
			hal_adc_voltagesupply_readmV();
	g_ResultsOfLastMeasurement.BatteryPercentageStamp =
			mathematics_CalcPercentage(BATVOLTAGE_MIN, BATVOLTAGE_MAX,
					                   g_ResultsOfLastMeasurement.BatteryPercentageStamp);

//	g_ResultsOfLastMeasurement.temp = hal_adc_tempsensor_readCelsius();

//	g_ResultsOfLastMeasurement.DateAndTimeStamp =
#endif
	datapointIndex++;
}

float resultsCalcVolume(uint16_t rate)
{
	// Scale the Volume data based upon the correct Flow Rate unit
	if(GPM == g_ResultsOfLastMeasurement.FR_unit)
	{
		return (float)( ( (float)g_ResultsOfLastMeasurement.last_FlowRate *
				(float)rate )
				/ ( (float) MILLISECONDS_IN_MIN) );
	}
	else
	{
		return (float)( ( (float)g_ResultsOfLastMeasurement.last_FlowRate *
				(float)rate )
				/ ( (float) MILLISECONDS_IN_HOUR) );
	}
}
